from time import sleep
from userbot import CMD_HELP
from userbot.events import register


@register(outgoing=True, pattern='^.sadboy(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    sleep(2)
    await typew.edit("`Pertama-tama kamu cantik`")
    sleep(2)
    await typew.edit("`Kedua kamu manis`")
    sleep(1)
    await typew.edit("`Dan yang terakhir adalah kamu bukan jodohku`")

# Create by myself @localheart


@register(outgoing=True, pattern='^.punten(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("`\n┻┳|―-∩`"
                     "`\n┳┻|     ヽ`"
                     "`\n┻┳|    ● |`"
                     "`\n┳┻|▼) _ノ`"
                     "`\n┻┳|￣  )`"
                     "`\n┳ﾐ(￣ ／`"
                     "`\n┻┳T￣|`"
                     "\n**Punten**")

# Create by myself @localheart


@register(outgoing=True, pattern='^.pantau(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("`\n┻┳|―-∩`"
                     "`\n┳┻|     ヽ`"
                     "`\n┻┳|    ● |`"
                     "`\n┳┻|▼) _ノ`"
                     "`\n┻┳|￣  )`"
                     "`\n┳ﾐ(￣ ／`"
                     "`\n┻┳T￣|`"
                     "\n**Masih Ku Pantau**")


# Create by myself @localheart


@register(outgoing=True, pattern='^.idiot(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("\n╭╮╱╱╭╮"
                     "\n┃╰╮╭╯┃"
                     "\n╰╮╰╯╭┻━┳╮╭╮"
                     "\n╱╰╮╭┫╭╮┃┃┃┃"
                     "\n╱╱┃┃┃╰╯┃╰╯┃"
                     "\n╱╱╰╯╰━━┻━━╯"
                     "\nㅤㅤㅤ"
                     "\n╭━━━╮"
                     "\n┃╭━╮┃"
                     "\n┃┃╱┃┣━┳━━╮"
                     "\n┃╰━╯┃╭┫┃━┫"
                     "\n┃╭━╮┃┃┃┃━┫"
                     "\n╰╯╱╰┻╯╰━━╯"
                     "\nㅤㅤㅤ"
                     "\n╭━━━╮╱╭╮╱╱╱╭╮"
                     "\n┃╭━━╯╱┃┃╱╱╭╯╰╮"
                     "\n┃╰━━┳━╯┣┳━┻╮╭╯"
                     "\n┃╭━━┫╭╮┣┫╭╮┃┃"
                     "\n┃╰━━┫╰╯┃┃╰╯┃╰╮"
                     "\n╰━━━┻━━┻┻━━┻━╯"
                     "\nㅤㅤㅤ"
                     "\n╭━╮╱╭╮"
                     "\n┃┃╰╮┃┃"
                     "\n┃╭╮╰╯┣━━╮"
                     "\n┃┃╰╮┃┃╭╮┃"
                     "\n┃┃╱┃┃┃╰╯┃"
                     "\n╰╯╱╰━┻━━╯"
                     "\nㅤㅤㅤ"
                     "\n╭━━━╮╱╱╱╱╱╭╮╱╭╮"
                     "\n╰╮╭╮┃╱╱╱╱╱┃┃╭╯╰╮"
                     "\n╱┃┃┃┣━━┳╮╭┫╰┻╮╭╯"
                     "\n╱┃┃┃┃╭╮┃┃┃┃╭╮┃┃"
                     "\n╭╯╰╯┃╰╯┃╰╯┃╰╯┃╰╮"
                     "\n╰━━━┻━━┻━━┻━━┻━╯")


@register(outgoing=True, pattern=r"^\.pagi$")
async def pagi(e):
    if not e.text[0].isalpha() and e.text[0] not in ("/", "#", "@", "!"):
        await e.edit(
"`\n
 ^ _ ^ ) `"
"`\n.................^v^ `"
"`\n⋱ ⋮ ⋰ `"
"`\n⋯ ◯ ⋯¨. ︵ ..............................................^v^ `"
"`\n¨︵¸︵( ░░ )︵.︵.︵..............^v^ `"
"`\n... (´░░░░░░ ') ░░░' ) `"
"`\n´︶´¯︶´︶´︶´︶.....^v^..........^v^ `"
"`\n....^v^....▄▀▀──▄▀▀▄─▄▀▀▄─█▀▄....^v^....`"
"`\n....^v^....█─▀█─█──█─█──█─█─█....^v^....`"
"`\n....^v^....─▀▀───▀▀───▀▀──▀▀─....^v^....`"
"`\n....^v^........^v^........^v^........^v^........^v^....`"
"`\n█▄─▄█─▄▀▀▄─█▀▄─█▄─█─█─█▄─█─▄▀▀─`"
"`\n█─▀─█─█──█─██▀─█─▀█─█─█─▀█─█─▀█`"
"`\n▀───▀──▀▀──▀─▀─▀──▀─▀─▀──▀──▀▀─`"
)

# Create by @Ultdroid


@ register(outgoing = True, pattern = r"^\.mlm$")
async def mlm(e):
    if not e.text[0].isalpha() and e.text[0] not in ("/", "#", "@", "!"):
        await e.edit(
"`\n┌▀█┌▀█┌▀█┌▀█┌▀█┌▀█┌▀█`"
"`\n┌▀█╔══╗╔══╗╔══╗╔══╗▀█`"
"`\n┌▀█║╔═╣║╔╗║║╔╗║╚╗╗║▀█`"
"`\n┌▀█║╚╗║║╚╝║║╚╝║╔╩╝║▀█`"
"`\n┌▀█╚══╝╚══╝╚══╝╚══╝▀█`"
"`\n┌▀█┌▀█┌▀█┌▀█┌▀█┌▀█┌▀█`"
"`\n┌▀█░░░░░░░░░░░░░░░░▀█`"
"`\n┌▀█░░█▌▌█▐▀▐░▌▀█▀░░▀█`"
"`\n┌▀█░░█▐▌█▐▐▐▀▌░█░░░▀█`"
"`\n┌▀█░░█░▌█▐█▐░▌░█░░░▀█`"
"`\n┌▀█░░░░░░░░░░░░░░░░▀█`"
"`\n┌▀█┌▀█┌▀█┌▀█┌▀█┌▀█┌▀█`"
"`\n`"
"`\n,`"
"`\n 🌙.     *       ☄️      `"
"`\n 🌟   .  *       .         `"
"`\n                       *   .      🛰     .        ✨      * `"
"`\n  .     *   SLEEP WELL        🚀     `"
"`\n      .              . . SWEET DREAMS 🌙 `"
"`\n. *       🌏 GOOD NIGHT         * `"
"`\n                     🌙.     *       ☄️      `"
"`\n🌟   .  *       .         `"
"`\n                       *   .      🛰     .        ✨      * `"
)

# Create by @Ultdroid


CMD_HELP.update({
    "animasi":
    "𝘾𝙤𝙢𝙢𝙖𝙣𝙙: `.sadboy`\
    \nPenggunaan: Biasalah sadboy hikss\
    \n\n𝘾𝙤𝙢𝙢𝙖𝙣𝙙: `.punten` dan `.pantau`\
    \nPenggunaan: Coba aja.\
    \n\n𝘾𝙤𝙢𝙢𝙖𝙣𝙙: `.idiot`\
    \nPenggunaan: u're ediot xixixi.\
    \n\n𝘾𝙤𝙢𝙢𝙖𝙣𝙙: `pagi`\
    \nPenggunaan: Yaudah.\
    \n\n𝘾𝙤𝙢𝙢𝙖𝙣𝙙: `mlm`\
    \nPenggunaan: Jan gadang.\
    \n\n𝘾𝙤𝙢𝙢𝙖𝙣𝙙: `@dunottagme`\
    \nPenggunaan: Kasi aja ide ape ape kek 🥱"
})
